#+TITLE:Test BBMap-based shotgun analysis pipeline
*** Bacterial reference genomes
Download the bacterial reference genomes from [[file:~/ncsu-drive/research/vivo-vitro/strain-info/strains-uniprot.csv][strains-uniprot.csv]]
#+BEGIN_SRC shell :session brc
mkdir -p ~/data/vivo-vitro/references/bacteria
cd ~/data/vivo-vitro/references/bacteria
wget ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/011/065/GCA_000011065.1_ASM1106v1/GCA_000011065.1_ASM1106v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/017/765/GCA_000017765.1_ASM1776v1/GCA_000017765.1_ASM1776v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/020/225/GCA_000020225.1_ASM2022v1/GCA_000020225.1_ASM2022v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/154/125/GCA_000154125.1_ASM15412v1/GCA_000154125.1_ASM15412v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/154/205/GCA_000154205.1_ASM15420v1/GCA_000154205.1_ASM15420v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/156/535/GCA_000156535.1_ASM15653v1/GCA_000156535.1_ASM15653v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/162/015/GCA_000162015.1_ASM16201v1/GCA_000162015.1_ASM16201v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/169/015/GCA_000169015.1_ASM16901v1/GCA_000169015.1_ASM16901v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/169/035/GCA_000169035.1_ASM16903v1/GCA_000169035.1_ASM16903v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/173/815/GCA_000173815.1_ASM17381v1/GCA_000173815.1_ASM17381v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/189/595/GCA_000189595.1_Clos_symb_WAL_14163_V1/GCA_000189595.1_Clos_symb_WAL_14163_V1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/209/935/GCA_000209935.1_ASM20993v1/GCA_000209935.1_ASM20993v1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/296/465/GCA_000296465.1_Barn_inte_YIT_11860_V1/GCA_000296465.1_Barn_inte_YIT_11860_V1_genomic.fna.gz ftp://ftp.ncbi.nlm.nih.gov/genomes/all/GCA/000/327/045/GCA_000327045.1_ASM32704v1/GCA_000327045.1_ASM32704v1_genomic.fna.gz
#+END_SRC

Index bacterial genomes for use with BBSplit
#+BEGIN_SRC shell :session brc
cd ~/data/vivo-vitro/references/bacteria
sbatch --exclusive --wrap="bbsplit.sh ref=."
#+END_SRC

#+RESULTS:
: cd ~/data/vivo-vitro/references/bacteria

*** BBDuk output statistics for test sample (17_1, fecal)

These next two tables are read in from the local copies, as I'm having trouble getting the output of commands to the Org-babel `brc` session to get properly formatted.

*Adapter (and transposase) sequences*

#+BEGIN_SRC shell :no session
cat out-1/17_1-adapters-stats.txt
#+END_SRC

#+RESULTS:
| #File                                                  | raw/17_1.fastq.gz |           |
| #Total                                                 |           2956328 |           |
| #Matched                                               |            792943 | 26.82189% |
| #Name                                                  |             Reads |  ReadsPct |
| I7_Nextera_Transposase_1                               |            618446 | 20.91940% |
| I5_Nextera_Transposase_1                               |            172170 |  5.82378% |
| TruSeq_Adapter_Index_5                                 |               487 |  0.01647% |
| I7_Primer_Nextera_XT_and_Nextera_Enrichment_N701       |               395 |  0.01336% |
| Illumina Small RNA v1.5 3p Adapter                     |               297 |  0.01005% |
| PhiX_read2_adapter                                     |               153 |  0.00518% |
| I7_Primer_Nextera_XT_and_Nextera_Enrichment_N703       |               126 |  0.00426% |
| I7_Primer_Nextera_XT_and_Nextera_Enrichment_N702       |               117 |  0.00396% |
| Reverse_adapter                                        |               115 |  0.00389% |
| PhiX_read1_adapter                                     |               111 |  0.00375% |
| Nextera_LMP_Read2_External_Adapter                     |                81 |  0.00274% |
| TruSeq_Universal_Adapter                               |                66 |  0.00223% |
| RNA_Adapter_(RA5)_part_#_15013205                      |                55 |  0.00186% |
| I7_Nextera_Transposase_2                               |                47 |  0.00159% |
| TruSeq_Adapter_Index_1_6                               |                47 |  0.00159% |
| I5_Primer_Nextera_XT_and_Nextera_Enrichment_[N/S/E]501 |                38 |  0.00129% |
| Nextera_LMP_Read1_External_Adapter                     |                35 |  0.00118% |
| RNA_PCR_Primer_Index_1_(RPI1)_2,9                      |                31 |  0.00105% |
| RNA_PCR_Primer_(RP1)_part_#_15013198                   |                25 |  0.00085% |
| Bisulfite_R1                                           |                23 |  0.00078% |
| I5_Adapter_Nextera                                     |                23 |  0.00078% |
| Bisulfite_R2                                           |                20 |  0.00068% |
| I5_Nextera_Transposase_2                               |                16 |  0.00054% |
| I7_Adapter_Nextera_No_Barcode                          |                16 |  0.00054% |
| I7_Primer_Nextera_XT_Index_Kit_v2_N727                 |                 2 |  0.00007% |
| I7_Primer_Nextera_XT_Index_Kit_v2_N715                 |                 1 |  0.00003% |

*PhiX*
#+BEGIN_SRC shell :no session
cat out-1/17_1-phix-stats.txt
#+END_SRC

#+RESULTS:
| #File    | stdin.fq |          |
| #Total   |  2954419 |          |
| #Matched |        0 | 0.00000% |
| #Name    |    Reads | ReadsPct |

1 read matched to PhiX out of all three samples.

BJC notes that PhiX is often or usually not added to shotgun libraries, so this isn't surprising.

*Trimming*

Manually created from the file slurm-1497933.out.

| Input:         | 2954419 reads           | 269436736 bases.         |
| QTrimmed:      | 72 reads (0.00%)        | 495 bases (0.00%)        |
| FTrimmed:      | 2163385 reads (73.23%)  | 2163385 bases (0.80%)    |
| Total Removed: | 0 reads (0.00%)         | 2163880 bases (0.80%)    |
| Result:        | 2954419 reads (100.00%) | 267272856 bases (99.20%) |

**** Fraction of unmapped reads
One way to compute is to compare the lines in the Fastq files of unmapped reads and the input file.
#+BEGIN_SRC shell :no session :results verbatim
SAMPLES=(13_1 14_1 17_1)
for SAMPLE in ${SAMPLES[*]}
do
    l1=$(zcat output/out-3/$SAMPLE-unmapped.fq.gz | wc -l)
    l2=$(zcat output/out-2/$SAMPLE.fq.gz | wc -l)
    echo $SAMPLE
    bc <<< "scale=3; $l1 / $l2"
    echo
done
#+END_SRC

#+RESULTS:
: 13_1
: .001
:
: 14_1
: .078
:
: 17_1
: .007

Notes
- Largest for the inoculum sample; expected due to Staph contamination
- Low fraction for fecal sample suggests E. coli H2 receiving nearly all E. coli reads
- Perhaps I can get the fraction of unmapped reads from the refstats file or std out

**** Sample 13_1: T. mobilis positive control
#+BEGIN_SRC R :session bbsplit
refstats %>% filter(sample == "13_1") %>% select(-sample)
#+END_SRC

#+RESULTS:
| species                      | % unambig | % ambig | unambig | ambig | assigned |
|------------------------------+-----------+---------+---------+-------+----------|
| Bacteroides ovatus           |   0.00013 |   2e-05 |       6 |     1 |        6 |
| Bacteroides thetaiotaomicron |         0 |   2e-05 |       0 |     1 |        1 |
| Bacteroides uniformis        |     2e-05 |       0 |       1 |     0 |        1 |
| Collinsella aerofaciens      |         0 |   4e-05 |       0 |     2 |        2 |
| Escherichia coli             |   0.00361 |   4e-05 |     166 |     2 |      166 |
| Faecalibacterium prausnitzii |         0 | 0.00013 |       0 |     6 |        0 |
| Marvinbryantia formatexigens |         0 | 0.00013 |       0 |     6 |        6 |
| Roseburia intestinalis       |     2e-05 |       0 |       1 |     0 |        1 |
| Thioflavicoccus mobilis      |  99.83172 | 0.00022 | 4590572 |    10 |  4590573 |

0.1% reads unmapped

Notes
- E. coli is a common contaminant; could explain higher fraction
- Remaining species low enough to suggest UDI working; will need to evaluate fully
**** Sample 14_1: Inoculum sample
#+BEGIN_SRC R :session bbsplit
refstats %>% filter(sample == "14_1") %>% select(-sample)
#+END_SRC

#+RESULTS:
| species                      | % unambig | % ambig | unambig | ambig | assigned |
|------------------------------+-----------+---------+---------+-------+----------|
| Akkermansia muciniphila      |    0.2521 | 0.00064 |    8678 |    22 |     8692 |
| Bacteroides caccae           |    0.1492 | 0.00633 |    5136 |   218 |     5322 |
| Bacteroides ovatus           |   0.37196 | 0.00883 |   12804 |   304 |    12804 |
| Bacteroides thetaiotaomicron |   0.11585 |  0.0079 |    3988 |   272 |     4260 |
| Bacteroides uniformis        |   0.37315 | 0.00851 |   12845 |   293 |    12851 |
| Barnesiella intestinihominis |   0.00067 | 0.00052 |      23 |    18 |       41 |
| Clostridium symbiosum        |  18.18653 | 0.02402 |  626033 |   827 |   626284 |
| Collinsella aerofaciens      |   1.65736 | 0.00052 |   57051 |    18 |    57068 |
| Escherichia coli             |  63.82434 | 0.00264 | 2197019 |    91 |  2197023 |
| Eubacterium rectale          |   0.06159 | 0.02806 |    2120 |   966 |     2251 |
| Faecalibacterium prausnitzii |   1.52413 | 0.01685 |   52465 |   580 |    52468 |
| Marvinbryantia formatexigens |   4.06357 | 0.01389 |  139880 |   478 |   140067 |
| Roseburia intestinalis       |   1.45182 | 0.03495 |   49976 |  1203 |    51170 |
| Thioflavicoccus mobilis      |   0.01156 | 0.00244 |     398 |    84 |      461 |

7.8% reads unmapped

Notes
- Barnesiella was undetected in a large fraction of protocol 1 inoculum samples in the A1 data, and had a frequency of ~10^-4 in the others.
- Fraction 0.00014 of T. mobilis reads, vs 0.00045 in the A1 data
- Unclear on def of ambiguous and assigned reads
  - e.g., why Barnesiella gets all its ambig reads, while Eubacterium retale get's only a few
- Typically, ambig reads << unambig; but not always, esp. for rare taxa
**** Sample 17_1: Fecal sample
#+BEGIN_SRC R :session bbsplit
refstats %>% filter(sample == "17_1") %>% select(-sample)
#+END_SRC

#+RESULTS:
| species                      | % unambig | % ambig | unambig | ambig | assigned |
|------------------------------+-----------+---------+---------+-------+----------|
| Akkermansia muciniphila      |   4.03196 |   3e-05 |  118251 |     1 |   118251 |
| Bacteroides caccae           |    4.3222 | 0.45297 |  126763 | 13285 |   138115 |
| Bacteroides ovatus           |  49.52295 | 0.67876 | 1452428 | 19907 |  1452428 |
| Bacteroides thetaiotaomicron |  18.65118 | 0.55925 |  547009 | 16402 |   563408 |
| Bacteroides uniformis        |  18.75214 | 0.54538 |  549970 | 15995 |   550497 |
| Barnesiella intestinihominis |    0.5211 | 0.00061 |   15283 |    18 |    15299 |
| Clostridium symbiosum        |    0.2263 | 0.00068 |    6637 |    20 |     6639 |
| Collinsella aerofaciens      |   0.00897 |       0 |     263 |     0 |      263 |
| Escherichia coli             |   1.55361 |  0.0001 |   45565 |     3 |    45565 |
| Eubacterium rectale          |   0.00058 | 0.00324 |      17 |    95 |       19 |
| Faecalibacterium prausnitzii |    0.0002 | 0.00058 |       6 |    17 |        6 |
| Marvinbryantia formatexigens |   0.33582 | 0.00027 |    9849 |     8 |     9853 |
| Roseburia intestinalis       |   0.31226 | 0.00399 |    9158 |   117 |     9275 |
| Thioflavicoccus mobilis      |    0.0001 |  0.0001 |       3 |     3 |        6 |

0.7% reads unmapped

Notes
- How to consider presence absence and compute abundances for F. prausnitzii, E. rectale?
  - Plan is to drop F. prausnitzii (as not having colonized), but include E. rectale. How to get good estimates of E. rectale?
- The %'s very roughly line up with expected from A1 data
  - Differences of ~10x for some taxa indicate potential bias (not accounting for genome size)
